#!/usr/bin/env python
# -*- coding: utf-8 -*-
# امیرعلی محمدی
# 4011833239
import turtle # جهت نمایش صحیح حروف فارسی از کتابخانه ای برای نمایش گرافیکی استفاده شده است
maxi = 10000000000000000000000000000000000000000000000000000000000000
s = turtle.Screen()
s.bgcolor("black")
s.setup(width=0.333, height=0.333)
n = s.numinput('دریافت مبلغ',':مبلغ را به تومان وارد کنید', minval=0, maxval= maxi)
n = int(n)
# تبدیل تومان به ريال
n *= 10
# ساختن تابع عملیات پروژه
def fun(l):
    dic1 = {1:'یک',2:'دو',3:'سه', 4:'چهار',5:'پنج',6:'شش',7:'هفت',8:'هشت',9:'نه', 10:'ده',11:'یازده',12:'دوازده',13:'سیزده',14:'چهارده',15:'پانزده',16:'شانزده',17:'هفده',18:'هجده',19:'نوزده'}
    dic2 = {20:'بیست',30:'سی',40:'چهل',50:'پنجاه',60:'شصت',70:'هفتاد',80:'هشتاد',90:'نود'}
    dic3 = {100:'صد',200:'دویست',300:'سیصد',400:'چهارصد',500:'پانصد',600:'ششصد',700:'هفتصد',800:'هشتصد',900:'نهصد'}
    dic4 = {10**6:'میلیون'}
    dic4 = {10**9:'بیلیون'}
    dic4 = {10**12:'تریلیون'}
    dic4 = {10**15:'کوآدریلیون'}
    dic4 = {10**18:'کوینتیلیون'}
    dic4 = {10**21:'سکستیلیون'}
    dic4 = {10**24:'سپتیلیون'}
    dic4 = {10**27:'اکتیلیون'}
    dic4 = {10**30:'نانیلیون'}
    dic4 = {10**33:'دسیلیون'}
    dic4 = {10**36:'آندسیلیون'}
    dic4 = {10**39:'دیودسیلیون'}
    dic4 = {10**42:'تریدسیلیون'}
    dic4 = {10**45:'کواتیوردسیلیون'}
    dic4 = {10**48:'کویندسیلیون'}
    dic4 = {10**51:'سکسدسیلیون'}
    dic4 = {10**54:'سپتدسیلیون'}
    dic4 = {10**57:'اُکتودسیلیون'}
    dic4 = {10**60:'نومدسیلیون'}